app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ? ORDER BY "entries"."id" DESC LIMIT 1  [["feed_id", 5]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    render :json => Feed.find(params[:id]).as_json(methods: :latest_entries)